#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/2c93628d-2813-4fdb-8deb-756c1b0ee181/resourceGroups/taco-production-workshop]
azurerm_network_security_group.catapp-sg: Refreshing state... [id=/subscriptions/2c93628d-2813-4fdb-8deb-756c1b0ee181/resourceGroups/taco-production-workshop/providers/Microsoft.Network/networkSecurityGroups/taco-production-sg]
azurerm_public_ip.catapp-pip: Refreshing state... [id=/subscriptions/2c93628d-2813-4fdb-8deb-756c1b0ee181/resourceGroups/taco-production-workshop/providers/Microsoft.Network/publicIPAddresses/taco-production-ip]
azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/2c93628d-2813-4fdb-8deb-756c1b0ee181/resourceGroups/taco-production-workshop/providers/Microsoft.Network/virtualNetworks/taco-production-vnet]
azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/2c93628d-2813-4fdb-8deb-756c1b0ee181/resourceGroups/taco-production-workshop/providers/Microsoft.Network/virtualNetworks/taco-production-vnet/subnets/taco-production-subnet]
azurerm_network_interface.catapp-nic: Refreshing state... [id=/subscriptions/2c93628d-2813-4fdb-8deb-756c1b0ee181/resourceGroups/taco-production-workshop/providers/Microsoft.Network/networkInterfaces/taco-production-catapp-nic]
azurerm_network_interface_security_group_association.catapp-nic-sg-ass: Refreshing state... [id=/subscriptions/2c93628d-2813-4fdb-8deb-756c1b0ee181/resourceGroups/taco-production-workshop/providers/Microsoft.Network/networkInterfaces/taco-production-catapp-nic|/subscriptions/2c93628d-2813-4fdb-8deb-756c1b0ee181/resourceGroups/taco-production-workshop/providers/Microsoft.Network/networkSecurityGroups/taco-production-sg]
azurerm_linux_virtual_machine.catapp: Refreshing state... [id=/subscriptions/2c93628d-2813-4fdb-8deb-756c1b0ee181/resourceGroups/taco-production-workshop/providers/Microsoft.Compute/virtualMachines/taco-production-meow]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.catapp must be replaced
-/+ resource "azurerm_linux_virtual_machine" "catapp" {
      ~ computer_name                                          = "taco-production-meow" -> (known after apply)
      ~ custom_data                                            = (sensitive value) # forces replacement
      + disk_controller_type                                   = (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/2c93628d-2813-4fdb-8deb-756c1b0ee181/resourceGroups/taco-production-workshop/providers/Microsoft.Compute/virtualMachines/taco-production-meow" -> (known after apply)
        name                                                   = "taco-production-meow"
      ~ private_ip_address                                     = "10.42.0.4" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.42.0.4",
        ] -> (known after apply)
      ~ public_ip_address                                      = "20.163.234.231" -> (known after apply)
      ~ public_ip_addresses                                    = [
          - "20.163.234.231",
        ] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
      - tags                                                   = {} -> null
      ~ virtual_machine_id                                     = "b4a5e474-d6fd-44f3-bd62-417564ea856d" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (30 unchanged attributes hidden)

      ~ os_disk {
          ~ name                             = "taco-production-meow_OsDisk_1_f7d659b7f99745dcab5d2523a49310af" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>

*Pusher: @DODPhillyNick, Action: `pull_request`, Working Directory: ``, Workflow: `Plan Production on PR to Main`*